function dy=S(~,y)
M=y(1)+y(2);%雄性
F=y(3)+y(4);%雌性c'c
N=M+F;%种群数
s=y(1)+y(3);%易感
i=y(2)+y(4);%感染
bilie = M/(M+F);%雌雄比例
c=0.08;%调节出生率的参数
B=bilie*(1-bilie)*c;%出生率
k=1;%调节转化比的参数
Z=0.40/(1+(y(5))^k)+0.63;%雌雄转化率
r3=0.5;%被捕食者出生率
d1=0.04;d2=0.03;%雌/雄死亡率
b11=0.08;b12=0.04;b21=0.07;b22=0.03;%雌/雄捕食效率
k=0.001;%感染几率
dj=0.001;%因为寄生而死
a=0.012;
%输出y，y是五行一列
dy=[0;0;0;0;0];
n=numel(y);
if n<3
y=[y;0;0];
end
dy(1)=B*Z*N-d1*y(1)-k*y(1)*i+b11*a*y(5)*y(1);
dy(2)=k*y(1)*i-(d1+dj)*y(2)+b12*a*y(2)*y(5);
dy(3)=B*(1-Z)*N-d2*y(2)-k*y(3)*i+b21*a*y(5)*y(3);
dy(4)=k*y(3)*i-(d2+dj)*y(4)+b22*a*y(5)*y(4);
dy(5)=r3*y(5)-a*N*y(5)-0.001;
end